## Plan Result (demo_global)




<pre><code>Plan: 5 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dss&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dss&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dss&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dss&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.caching_rule[&#34;dss&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["dss"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/dss"
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["dss"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/dss"
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["fact-admin"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/factadmindemoPremium"
        name                              = "factadmindemoPremium"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
            "startupMode"  = "always"
        }
        # (9 unchanged attributes hidden)

      ~ managed_rule {
            # (3 unchanged attributes hidden)

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "auth_verification"
            }

            # (17 unchanged blocks hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dss"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/dss",
        ]
      + cdn_frontdoor_endpoint_id       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/dss"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/dss/origins/dss",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/ruleSets/dsscaching",
        ]
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "dss"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["dss"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/dss",
        ]
      + cdn_frontdoor_endpoint_id       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/ruleSets/dsscaching",
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "dssHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.caching_rule["dss"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "caching_rule" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/ruleSets/dsscaching"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dsscachingrule"
      + order                       = 3

      + actions {
          + route_configuration_override_action {
              + cache_behavior                = "HonorOrigin"
              + compression_enabled           = false
              + query_string_caching_behavior = "UseQueryString"
            }
        }

      + conditions {
          + url_file_extension_condition {
              + match_values     = [
                  + "jpg",
                  + "png",
                  + "css",
                  + "ico",
                  + "js",
                ]
              + negate_condition = false
              + operator         = "Equal"
              + transforms       = [
                  + "Lowercase",
                ]
            }
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2190,"Program":"tfcmt","SHA1":"","Target":"demo_global","Vars":{}} -->